---
kind: type
id: T:Autodesk.Revit.DB.LeaderArrayIterator
source: html/18c89236-4fdb-5d13-3f0e-052daeeb1586.htm
---
# Autodesk.Revit.DB.LeaderArrayIterator

An iterator to an array of leaders.

## Syntax (C#)
```csharp
public abstract class LeaderArrayIterator : APIObject,
	IEnumerator
```